In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

# Series

## Create a serie

- data must be 1-dimensional

- data type needs an order: list, tuple, array...

In [7]:
labels=['a','b','c','d','e']
my_data=[1,2,3,4,5]
a=np.array(my_data)
d={'a':1,'b':2,'c':3,'d':4,'e':5}

In [8]:
# pass in a list
pd.Series(my_data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# pass in a list together with a list of labels
pd.Series(my_data,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
# pass in with 'data=' and 'index='
pd.Series(data=my_data,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
# pass in an array
pd.Series(a,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [35]:
# pass in a dict, auto define index and data
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
# tuple
pd.Series((1,2,3,4))

0    1
1    2
2    3
3    4
dtype: int64

## Select member as in a list or dict

In [42]:
s0=pd.Series(data=[1,2,3])
s0

0    1
1    2
2    3
dtype: int64

In [44]:
s0[1]

2

In [38]:
s1=pd.Series([1,2,3,4],['a','b','c','d'])
s1

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
s1['c']

3

In [39]:
s2=pd.Series([1,2,6,4],['a','b','e','d'])
s2

a    1
b    2
e    6
d    4
dtype: int64

In [22]:
s2['e']

6

## Operations between Series

In [24]:
# addition ... only works under condition like same types
s1+s2

a    2.0
b    4.0
c    NaN
d    8.0
e    NaN
dtype: float64

# Dataframes

- A dataframe is a collection of Series

## Create by `data` = matrix, `index`=list, `columns`=list

- `data` must be 2d
- notice a list is **not** 1d, its shape is (a, ) which is m x 1.
- selecttion: use [ ] for selecting columns. Each column is again a Serie, so we can use [ ] to select as in Serie

In [31]:
np.random.seed(101)

In [15]:
# a list is considered as an array, and then a serie in column form!!!
np.array([1,2,3]).shape

(3,)

In [45]:
# cast in a set
pd.DataFrame({1,5,1,2,5})

   0
0  1
1  2
2  5

In [8]:
# cast in a list
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [32]:
# cast in a tuple
pd.DataFrame((1,2,3,4))

   0
0  1
1  2
2  3
3  4

In [34]:
# cast in an array with shape differs 0 always work, since array is always 2d: shape is (a, 1) or (c, b)
pd.DataFrame(np.array((1,2,3)))

   0
0  1
1  2
2  3

In [8]:
# cast in a dict, not work
d={'a':1,'b':2,'c':3}
pd.DataFrame(d)  # give error

ValueError: If using all scalar values, you must pass an index

In [2]:
d = {'a':[1],'b':[2],'c':[3]}
pd.DataFrame(d)

   a  b  c
0  1  2  3

In [23]:
# however, if a dic has at least one value of the type: list and set then it works and keys are the names of columns
d={'a':{1} ,'b':2,'c':3 }
pd.DataFrame(d)

     a  b  c
0  {1}  2  3

In [3]:
np.array([1,2,3]).reshape(1,3)

array([[1, 2, 3]])

In [6]:
pd.DataFrame(np.array([1,2,3]).reshape(1,3))

   0  1  2
0  1  2  3

**Achtung**

In [10]:
pd.DataFrame(data={'a':[1],'b':[2],'c':[3]},index=[1,3,6])

   a  b  c
1  1  2  3
3  1  2  3
6  1  2  3

In [12]:
pd.DataFrame(data={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]},index=[1,3,6])

   a  b  c
1  1  2  3
3  2  3  4
6  3  4  5

In [13]:
pd.DataFrame(data={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]},index=[1,3,6],columns=('A','M','N'))

     A    M    N
1  NaN  NaN  NaN
3  NaN  NaN  NaN
6  NaN  NaN  NaN

In [17]:
pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['a','b','c','d'], columns=('M','N','P','Q','R'))

    M   N   P   Q   R
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

- Before moving ahead, note that cast in a dict into array gives shape (   ) with no information. This means it is not a 2d data.

- To cast a dict into df, make it a Serie

In [54]:
np.array(d)

array({'a': 1, 'b': 2, 'c': 3}, dtype=object)

In [48]:
# a dict in an array is nothing!
np.array(d).shape #

()

In [51]:
pd.Series(np.array(d)).shape

(1,)

In [52]:
# make a serie first
pd.DataFrame(pd.Series(d))

   0
a  1
b  2
c  3

In [53]:
# make a serie, but result is strange. This is because np.array(d) gives an object of no dimension.
pd.DataFrame(pd.Series(np.array(d)))

                          0
0  {'a': 1, 'b': 2, 'c': 3}

In [2]:
df=pd.DataFrame(data=randn(3,4), index=['a','b','c'],columns=['x','y','z','t'])
df

          x         y         z         t
a -1.269640  0.063923  0.141859  1.120527
b -0.798295 -0.498797  1.393478  0.421979
c -0.500079 -1.332776  1.411536 -0.325615

In [3]:
df=pd.DataFrame(data=randn(3,4),columns=['x','y','z','t'])
df

          x         y         z         t
0 -0.975850 -1.424263  1.969346  0.766044
1 -0.348410 -2.490945 -0.133304 -0.001007
2 -1.248737  0.382402 -1.520178  0.030411

In [4]:
df=pd.DataFrame(data=randn(3,4))
df

          0         1         2         3
0 -1.182389  1.723522 -1.085715 -0.909926
1  1.350879  0.758867  0.268976 -1.463855
2  0.564810 -1.728718 -0.302354  1.874664

## Selection

In [12]:
df=pd.DataFrame(data=randn(3,4),columns=['x','y','z','t'], index=['a','b','c'])
df

          x         y         z         t
a -0.583684  0.726308 -0.466457 -0.405671
b  0.478518  0.574989  0.858982  1.591487
c  0.759054  1.178949 -0.703926  0.814416

In [31]:
df

          x         y         z         t
a -0.583684  0.726308 -0.466457 -0.405671
b  0.478518  0.574989  0.858982  1.591487
c  0.759054  1.178949 -0.703926  0.814416

- turn to array

In [32]:
df.values

array([[-0.58368449,  0.72630836, -0.4664568 , -0.40567057],
       [ 0.47851767,  0.57498883,  0.85898242,  1.59148744],
       [ 0.75905399,  1.17894879, -0.70392622,  0.81441588]])

In [34]:
df.to_numpy()

array([[-0.58368449,  0.72630836, -0.4664568 , -0.40567057],
       [ 0.47851767,  0.57498883,  0.85898242,  1.59148744],
       [ 0.75905399,  1.17894879, -0.70392622,  0.81441588]])

In [ ]:
df[1] # error

In [13]:
df.x

a   -0.583684
b    0.478518
c    0.759054
Name: x, dtype: float64

In [14]:
# select a column, which is a Serie
df['x']

a   -0.583684
b    0.478518
c    0.759054
Name: x, dtype: float64

In [15]:
df[['x']]

          x
a -0.583684
b  0.478518
c  0.759054

In [19]:
df['a','y'] # error

KeyError: ('a', 'y')

In [28]:
df.loc['a','y']

0.7263083563304731

In [8]:
df.iloc[1]

x   -0.283010
y   -1.393416
z    0.878101
t   -0.346285
Name: 1, dtype: float64

In [9]:
df.loc[1
      ]

x   -0.283010
y   -1.393416
z    0.878101
t   -0.346285
Name: 1, dtype: float64

In [29]:
df.loc[['b','c']]

          x         y         z         t
b  0.478518  0.574989  0.858982  1.591487
c  0.759054  1.178949 -0.703926  0.814416

In [30]:
df.loc[['b','c'],:]

          x         y         z         t
b  0.478518  0.574989  0.858982  1.591487
c  0.759054  1.178949 -0.703926  0.814416

In [5]:
# select 2 columns, put in a list
df[['x','y']]

          x         y
a -1.269640  0.063923
b -0.798295 -0.498797
c -0.500079 -1.332776

In [6]:
# select a row
df.loc['b']

x   -0.798295
y   -0.498797
z    1.393478
t    0.421979
Name: b, dtype: float64

In [9]:
# very special way, select some rows successsively!!!!
df[1:3]

          x         y         z         t
b -0.798295 -0.498797  1.393478  0.421979
c -0.500079 -1.332776  1.411536 -0.325615

In [12]:
# other ways to select some rows successsively
df.loc[['b','c'],:]

          x         y         z         t
b -0.798295 -0.498797  1.393478  0.421979
c -0.500079 -1.332776  1.411536 -0.325615

In [13]:
df.loc['b']['z']

1.393478220591484

In [63]:
# select rows, put in a list
df.loc[['b','c']]

          x         y         z         t
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [64]:
# similar to selection in arrays, use a comma and more, two sets of indices in two lists
#df.loc[[],[]]

df.loc[['a','c'],['x','t']]

          x         t
a  2.706850  0.503826
c -2.018168 -0.589001

### Boolean df

In [66]:
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [69]:
# quite similar to array
df>0

       x      y      z      t
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False

In [70]:
df[df>0]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN

In [71]:
df['x']>0 # get a boolean serie

a     True
b     True
c    False
Name: x, dtype: bool

### select row satisfying a condition

In [76]:
# select row satisfying a condition
df[df['x']>0]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

### select rows with many conditions: using and: &,  or: |

In [74]:
df[(df['x']>0) | (df['y']<1)]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

### select columns with conditions

In [ ]:
df.loc[:,df.loc[2]==2] # for example

## c. Index

In [77]:
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [78]:
# reset index
df.reset_index() # keep old index

  index         x         y         z         t
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001

In [79]:
# set index
df.set_index('t') # write upon old index

                  x         y         z
t
 0.503826  2.706850  0.628133  0.907969
 0.605965  0.651118 -0.319318 -0.848077
-0.589001 -2.018168  0.740122  0.528813

In [80]:
# do both :)
df.reset_index().set_index('t')

          index         x         y         z
t
 0.503826     a  2.706850  0.628133  0.907969
 0.605965     b  0.651118 -0.319318 -0.848077
-0.589001     c -2.018168  0.740122  0.528813

## d. Multi index. I like that :)

In [82]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [83]:
zip(outside,inside)

In [85]:
list(zip(outside,inside)) # a list of tuples

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [86]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df=pd.DataFrame(randn(6,2),index=hier_index, columns=['a','b'])
df

             a         b
G1 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800
G2 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826

In [90]:
df['a'] # gives a df with only one col

G1  1   -0.116773
    2    0.238127
    3   -0.993263
G2  1   -1.136645
    2    1.025984
    3   -0.031579
Name: a, dtype: float64

In [91]:
df.loc['G1'] # gives a df, not a row

          a         b
1 -0.116773  1.901755
2  0.238127  1.996652
3 -0.993263  0.196800

### Name index

In [92]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [93]:
df.index.names

FrozenList([None, None])

In [94]:
# set a name
df.index.names=['Con chim','Con ku']

In [95]:
df

                        a         b
Con chim Con ku
G1       1      -0.116773  1.901755
         2       0.238127  1.996652
         3      -0.993263  0.196800
G2       1      -1.136645  0.000366
         2       1.025984 -0.156598
         3      -0.031579  0.649826

In [96]:
df.reset_index()

  Con chim  Con ku         a         b
0       G1       1 -0.116773  1.901755
1       G1       2  0.238127  1.996652
2       G1       3 -0.993263  0.196800
3       G2       1 -1.136645  0.000366
4       G2       2  1.025984 -0.156598
5       G2       3 -0.031579  0.649826

## Cross section

In [98]:
df

                        a         b
Con chim Con ku
G1       1      -0.116773  1.901755
         2       0.238127  1.996652
         3      -0.993263  0.196800
G2       1      -1.136645  0.000366
         2       1.025984 -0.156598
         3      -0.031579  0.649826

In [102]:
df.xs('G1',level='Con chim')

               a         b
Con ku
1      -0.116773  1.901755
2       0.238127  1.996652
3      -0.993263  0.196800

In [103]:
df.xs(1,level='Con ku')

                 a         b
Con chim
G1       -0.116773  1.901755
G2       -1.136645  0.000366

## Missing values

In [24]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [25]:
df=pd.DataFrame(d)

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
# drop rows
df.dropna()

     A    B  C
0  1.0  5.0  1

In [28]:
# drop cols
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [34]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
# drops only on subset, labeled along other axis
df.dropna(axis=1,how='any',subset=[2,1])

   C
0  1
1  2
2  3

In [40]:
# fill na for whole df
df.fillna(1) # or df.fillna(value=1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [41]:
# fill na for a col by mean
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [42]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

**pay attention**

In [36]:
df = pd.DataFrame({'shot':[1,2,np.nan,4,5,6,np.nan],'goal':[2,3,np.nan,5,6,7,np.nan], 'team':['A', 'B','B', 'B','C','C','C']})
df

   shot  goal team
0   1.0   2.0    A
1   2.0   3.0    B
2   NaN   NaN    B
3   4.0   5.0    B
4   5.0   6.0    C
5   6.0   7.0    C
6   NaN   NaN    C

way 1:

In [6]:
df.groupby('team')['shot'].transform('mean')

0    1.0
1    3.0
2    3.0
3    3.0
4    5.5
5    5.5
6    5.5
Name: shot, dtype: float64

In [7]:
df['shot'] = df['shot'].fillna(df.groupby('team')['shot'].transform('mean'))
df['goal'] = df['goal'].fillna(df.groupby('team')['goal'].transform('mean'))

print(df)

   shot  goal team
0   1.0   2.0    A
1   2.0   3.0    B
2   3.0   4.0    B
3   4.0   5.0    B
4   5.0   6.0    C
5   6.0   7.0    C
6   5.5   6.5    C

or

In [9]:
df['shot'].fillna(df.groupby('team')['shot'].transform('mean'), inplace=True)
df['goal'].fillna(df.groupby('team')['goal'].transform('mean'), inplace=True)
df

   shot  goal team
0   1.0   2.0    A
1   2.0   3.0    B
2   3.0   4.0    B
3   4.0   5.0    B
4   5.0   6.0    C
5   6.0   7.0    C
6   5.5   6.5    C

way 2 : doesnt work

In [11]:
df

   shot  goal team
0   1.0   2.0    A
1   2.0   3.0    B
2   NaN   NaN    B
3   4.0   5.0    B
4   5.0   6.0    C
5   6.0   7.0    C
6   NaN   NaN    C

In [14]:
B_meanshot = df.loc[df.loc[:,'team']=='B','shot'].mean()
B_meanshot

3.0

In [21]:
df.loc[df.loc[:,'team']=='B', 'shot']

1    2.0
2    NaN
3    4.0
Name: shot, dtype: float64

In [22]:
df.loc[df.loc[:,'team']=='B', 'shot'].fillna(B_meanshot, inplace=True)

In [23]:
df.loc[df.loc[:,'team']=='B', 'shot'].isnull().sum()

1

way 3: using another df to fill

In [37]:
a = df.groupby('team')[['shot', 'goal']].transform('mean')
a

   shot  goal
0   1.0   2.0
1   3.0   4.0
2   3.0   4.0
3   3.0   4.0
4   5.5   6.5
5   5.5   6.5
6   5.5   6.5

In [33]:
df['team']

0    A
1    B
2    B
3    B
4    C
5    C
6    C
Name: team, dtype: object

In [40]:
a['team']=df['team']
a

   shot  goal team
0   1.0   2.0    A
1   3.0   4.0    B
2   3.0   4.0    B
3   3.0   4.0    B
4   5.5   6.5    C
5   5.5   6.5    C
6   5.5   6.5    C

In [43]:
df.fillna(a,inplace=True)

In [44]:
df

   shot  goal team
0   1.0   2.0    A
1   2.0   3.0    B
2   3.0   4.0    B
3   4.0   5.0    B
4   5.0   6.0    C
5   6.0   7.0    C
6   5.5   6.5    C

## f. Groupby

In [44]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## g. Operations

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
# unique values
df['col2'].nunique()

3

In [7]:
# unique values with count
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col1']<3]

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [36]:
def f(x=100):
    return x%5

In [37]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Apply functions

In [20]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':[4,9,16,25]})
df

   col1  col2  col3
0     1   444     4
1     2   555     9
2     3   666    16
3     4   444    25

In [21]:
def f(cols): # it is really a row, not a col
    a = cols[0]
    b = cols[1]
    c = cols[2]
    return a + c

In [30]:
def g(row): # it is really a row, not a col
    a = row[0]
    b = row[1]
    c = row[2]
    if row[1] >400:
        return row[0] + row[2]
    else:
        return row[1]

In [31]:
# warum hier???
df.apply(g,axis=1)

0     5
1    11
2    19
3    29
dtype: int64

In [23]:
df.apply(f,axis=1)

0     5
1    11
2    19
3    29
dtype: int64

In [16]:
df[['col2', 'col1']].apply(f)

   col2  col1
0     4     1
1     0     2
2     1     3
3     4     4

In [18]:
df[['col2', 'col1']].apply(f,axis=1)

   col2  col1
0     4     1
1     0     2
2     1     3
3     4     4

In [38]:
df['col2'].apply(f)

0    4
1    0
2    1
3    4
Name: col2, dtype: int64

In [41]:
df['col2'].apply(lambda x: #number
                 x%5)

0    4
1    0
2    1
3    4
Name: col2, dtype: int64

In [39]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [43]:
df['col3'].apply(lambda st: st+'ku')

0    abcku
1    defku
2    ghiku
3    xyzku
Name: col3, dtype: object

In [46]:
df[['col1','col2']].apply(lambda x:#number
                         x*2%5)

   col1  col2
0     2     3
1     4     0
2     1     2
3     3     3

### sort

In [48]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.sort_values('col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [50]:
df.sort_values('col2',ascending=False,ignore_index=True)

   col1  col2 col3
0     3   666  ghi
1     2   555  def
2     1   444  abc
3     4   444  xyz

### pivot table

In [52]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### values of C become names of new columns, values in D become values in new df, new index is multi index

In [70]:
a=df.pivot_table(index=['A','B'],columns='C',values='D')
a

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [71]:
b=df.pivot_table(index=['B', 'A'],columns='C',values='D')
b

C          x    y
B   A
one bar  4.0  1.0
    foo  1.0  3.0
two bar  NaN  5.0
    foo  2.0  NaN

In [72]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## h. Input and output

In [78]:
pwd

'C:\\Users\\BVMT\\Desktop\\My Prog Knowl'

## i. Null values

In [6]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[444,555,666,444],'col3':['abc',np.nan,'ghi','xyz']})

In [7]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  NaN
2   3.0   666  ghi
3   NaN   444  xyz

In [10]:
pd.isnull(df['col3'])

0    False
1     True
2    False
3    False
Name: col3, dtype: bool

In [13]:
pd.isnull(df['col1'])

0    False
1    False
2    False
3     True
Name: col1, dtype: bool

In [14]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  NaN
2   3.0   666  ghi
3   NaN   444  xyz

In [17]:
df[1:3]

   col1  col2 col3
1   2.0   555  NaN
2   3.0   666  ghi

# Useful tips

# tip1

use `sum()` to count `True` value

In [8]:
df = pd.read_csv('train.csv')

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
print('First way')
display(df.isnull())

# or 
print('Second way')
pd.isnull(df)

First way

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

Second way

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [17]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
# example 2
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [19]:
df.duplicated().sum()

0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

# tip 2

use `map` instead of one hot encoding

In [32]:
df['Sex'] = df['Sex'].map({'male':0, 'female':1})

In [33]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [54]:
df['Sex']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

# tip 3

select numerical and categorical (object) columns, using `df.select_dtypes(include = [...])`

In [55]:
numerics = ['int16', 'int32', 'int64','float16', 'float32','float64']

In [57]:
df_num = df.select_dtypes(include=numerics)
df_num

     PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0              1         0       3    0  22.0      1      0   7.2500
1              2         1       1    1  38.0      1      0  71.2833
2              3         1       3    1  26.0      0      0   7.9250
3              4         1       1    1  35.0      1      0  53.1000
4              5         0       3    0  35.0      0      0   8.0500
..           ...       ...     ...  ...   ...    ...    ...      ...
886          887         0       2    0  27.0      0      0  13.0000
887          888         1       1    1  19.0      0      0  30.0000
888          889         0       3    1   NaN      1      2  23.4500
889          890         1       1    0  26.0      0      0  30.0000
890          891         0       3    0  32.0      0      0   7.7500

[891 rows x 8 columns]

In [58]:
# categorical
df_cat = df.select_dtypes(include=['object'])
df_cat

,Name,Ticket,Cabin,Embarked,first_name
0,"Braund, Mr. Owen Harris",A/5 21171,NaN,S,Mr. Owen Harris
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",PC 17599,C85,C,Mrs. John Bradley (Florence Briggs Thayer)
2,"Heikkinen, Miss. Laina",STON/O2. 3101282,NaN,S,Miss. Laina
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",113803,C123,S,Mrs. Jacques Heath (Lily May Peel)
4,"Allen, Mr. William Henry",373450,NaN,S,Mr. William Henry
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",211536,NaN,S,Rev. Juozas
887,"Graham, Miss. Margaret Edith",112053,B42,S,Miss. Margaret Edith
888,"Johnston, Miss. Catherine Helen ""Carrie""",W./C. 6607,NaN,S,"Miss. Catherine Helen ""Carrie"""
889,"Behr, Mr. Karl Howell",111369,C148,C,Mr. Karl Howell
890,"Dooley, Mr. Patrick",370376,NaN,Q,Mr. Patrick

In [59]:
df_num.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Sex              0.352413
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [23]:
df.mean()

C:\Users\BINH_H~1\AppData\Local\Temp/ipykernel_18232/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [24]:
df.mean().to_frame()

C:\Users\BINH_H~1\AppData\Local\Temp/ipykernel_18232/1416168335.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean().to_frame()

                      0
PassengerId  446.000000
Survived       0.383838
Pclass         2.308642
Age           29.699118
SibSp          0.523008
Parch          0.381594
Fare          32.204208

In [26]:
df.mode(axis=1)

C:\Users\Binh_Hong_Ngoc\anaconda3\lib\site-packages\pandas\core\algorithms.py:969: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'int'
  warn(f"Unable to sort modes: {err}")

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,0.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,889.0,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",female,1.0,2.0,W./C. 6607,23.45,S,NaN,NaN
889,0.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
df.median()

C:\Users\BINH_H~1\AppData\Local\Temp/ipykernel_18232/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
df['Embarked'].mode()

0    S
dtype: object

# Aggregate (agg)

ignorieren np.nan

## func = ein oder eine Liste der Funktionen

--> **trifft allen Spalten zu**

In [3]:
df1 = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df1

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [4]:
df1.agg(func='min')

A    1.0
B    2.0
C    3.0
dtype: float64

In [6]:
df1.agg(func=['min'])

       A    B    C
min  1.0  2.0  3.0

In [5]:
df1.agg(func=['sum','max'])

        A     B     C
sum  12.0  15.0  18.0
max   7.0   8.0   9.0

## funct = 1 dict, um die Info nur auf spezifische Spalten einzudmmen

In [7]:
df2 = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df2

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [8]:
df2.agg(func={'A':['sum','min'], 'C':['max','min','count']})

          A    C
sum    12.0  NaN
min     1.0  3.0
max     NaN  9.0
count   NaN  3.0

## viele Funktionen und umbenenen das Ergebnis

--> **benutzen neu_name = ('Spaltenname','Funktionenname')**

In [9]:
df3 = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df3

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [10]:
df3.agg(a=('A','count'), b=('B','min'))

     A    B
a  3.0  NaN
b  NaN  2.0

In [13]:
# df3.agg(a=('A',['count','max']), b=('B','min'))

# funktioniert nicht, weil nur eine Funktion erlaubt ist, nicht eine Liste

## groupby + agg

# Useful functions

## cut

In [2]:
x = np.arange(4)
x

array([0, 1, 2, 3])

In [3]:
pd.cut(x,bins=3)

[(-0.003, 1.0], (-0.003, 1.0], (1.0, 2.0], (2.0, 3.0]]
Categories (3, interval[float64, right]): [(-0.003, 1.0] < (1.0, 2.0] < (2.0, 3.0]]

In [8]:
pd.cut(x, bins=[1,2])

[NaN, NaN, (1.0, 2.0], NaN]
Categories (1, interval[int64, right]): [(1, 2]]

In [9]:
pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3)

[(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], (0.994, 3.0]]
Categories (3, interval[float64, right]): [(0.994, 3.0] < (3.0, 5.0] < (5.0, 7.0]]

In [13]:
pd.cut(np.array([1, 7, 5, 4, 6, 3])*1000, 3)

[(994.0, 3000.0], (5000.0, 7000.0], (3000.0, 5000.0], (3000.0, 5000.0], (5000.0, 7000.0], (994.0, 3000.0]]
Categories (3, interval[float64, right]): [(994.0, 3000.0] < (3000.0, 5000.0] < (5000.0, 7000.0]]